tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.aliyun.com/homebrew/homebrew-core.git"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "media-info"
brew "mitmproxy"
brew "most"
brew "neofetch"
brew "neovim"
brew "node", link: false
brew "nvm"
brew "stow"
brew "thrift"
brew "tmux"
brew "tree"
brew "pyenv"
brew "bpython"
brew "python"
brew "virtualenv"
brew "fnm"
brew "go"
brew "rust"
brew "lazygit"
brew "git-delta"
brew "imagemagick"

cask "anki"
cask "deepl"
cask "figma"
cask "iterm2"
cask "microsoft-edge"
cask "notion" 
cask "rectangle"
cask "spectacle"
cask "wechat"
cask "visual-studio-code"
cask "youdaodict"
cask "obs"
cask "activitywatch"
cask 'calibre'
cask 'webstorm'
cask 'sourcetree'
