tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.aliyun.com/homebrew/homebrew-core.git"
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "media-info"
brew "mitmproxy"
brew "most"
brew "neofetch"
brew "neovim"
brew "node", link: false
brew "nvm"
brew "stow"
brew "thrift"
brew "tmux"
brew "tree"
cask "anki"
cask "clashx"
cask "deepl"
cask "figma"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "notion"
cask "rectangle"
cask "spectacle"
cask "wechat"
